Repository: Codingtech2/muallimi-soniy-ios-mobile
Catalog: MuallimiSoniy/Localizable.xcstrings
Source language: en
Languages: ru, uz_cyrl, uz_uz

# a11y_play_hint
source: Double tap to play audio
ru: Дважды нажмите, чтобы воспроизвести аудио
uz_cyrl: Аудиони ижро этиш учун икки марта босинг
uz_uz: Audioni ijro etish uchun ikki marta bosing

# about_app
source: About
ru: О программе
uz_cyrl: Дастур ҳақида
uz_uz: Dastur haqida

# about_section
source: About App
ru: О приложении
uz_cyrl: Илова ҳақида
uz_uz: Ilova haqida

source: All Chapters
ru: Все темы
uz_cyrl: Барча мавзулар
uz_uz: Barcha mavzular

# app_name
source: Muallimi Soniy
ru: Муаллими Соний
uz_cyrl: Муаллими Соний

# app_subtitle
source: Arabic Language Learning Platform
ru: Платформа изучения арабского языка
uz_cyrl: Араб тили ўрганиш платформаси
uz_uz: Arab tili oʻrganish platformasi

source: Audio
ru: Аудио
uz_cyrl: Аудио

# audio_desc
source: Repeat, speed and volume
ru: Повтор, скорость и громкость
uz_cyrl: Такрор, тезлик ва овоз баландлиги
uz_uz: Takror, tezlik va ovoz balandligi

source: Audio not downloaded
ru: Аудио не загружено
uz_cyrl: Аудио юкланмаган
uz_uz: Audio yuklanmagan

# audio_not_downloaded_desc
source: Audio (~127 MB) hasn't been downloaded yet. Download it to listen to this lesson.
ru: Аудио (~127 МБ) ещё не загружено. Скачайте его, чтобы прослушать этот урок.
uz_cyrl: Аудио (~127 MB) ҳали юкланмаган. Ушбу дарсни тинглаш учун уни юклаб олинг.
uz_uz: Audio (~127 MB) hali yuklanmagan. Ushbu darsni tinglash uchun uni yuklab oling.

# bg_gray
source: Gray
ru: Серый
uz_cyrl: Кулранг
uz_uz: Kulrang

# bg_night
source: Night
ru: Ночной
uz_cyrl: Тунги
uz_uz: Tungi

# bg_paper
source: White
ru: Белый
uz_cyrl: Оқ
uz_uz: Oq

# bg_sepia
source: Sepia
ru: Сепия
uz_cyrl: Сепия
uz_uz: Sepiya

source: Bold Text
ru: Жирный текст
uz_cyrl: Қалин шрифт
uz_uz: Qalin shrift

# book_author
source: Ahmad Hodiy Maqsudiy
ru: Ахмад Ходи Максуди
uz_cyrl: Аҳмад Ҳодий Мақсудий

source: Book not found
ru: Книга не найдена
uz_cyrl: Китоб топилмади
uz_uz: Kitob topilmadi

# book_tagline
source: Ahmad Hodiy Maqsudiy — an Arabic alphabet primer
ru: Ахмад Ходи Максуди — учебник арабского алфавита
uz_cyrl: Аҳмад Ҳодий Мақсудий — араб алифбоси дарслиги
uz_uz: Ahmad Hodiy Maqsudiy — arab alifbosi darsligi

source: Cancel
ru: Отмена
uz_cyrl: Бекор қилиш
uz_uz: Bekor qilish

# chapters_unit
source: chapters
ru: глав
uz_cyrl: боб
uz_uz: bob

source: Close
ru: Закрыть
uz_cyrl: Ёпиш
uz_uz: Yopish

source: Completed
ru: Завершено
uz_cyrl: Тугалланган
uz_uz: Tugallangan

# content_not_loaded
source: Content failed to load.
ru: Не удалось загрузить контент.
uz_cyrl: Контент юкланмади.
uz_uz: Kontent yuklanmadi.

source: Contents
ru: Оглавление
uz_cyrl: Мундарижа
uz_uz: Mundarija

source: Continue
ru: Продолжить
uz_cyrl: Давом этинг
uz_uz: Davom eting

source: Dark
ru: Тёмная
uz_cyrl: Тунги
uz_uz: Tungi

source: Decrease
ru: Уменьшить
uz_cyrl: Камайтириш
uz_uz: Kamaytirish

source: Download
ru: Скачать
uz_cyrl: Юклаб олиш
uz_uz: Yuklab olish

source: Download error
ru: Ошибка загрузки
uz_cyrl: Юклаб олишда хатолик
uz_uz: Yuklab olishda xatolik

source: Download Now
ru: Скачать сейчас
uz_cyrl: Ҳозир юклаб олиш
uz_uz: Hozir yuklab olish

source: Downloading…
ru: Загрузка…
uz_cyrl: Юкланмоқда…
uz_uz: Yuklanmoqda…

source: Extracting…
ru: Распаковка…
uz_cyrl: Очилмоқда…
uz_uz: Ochilmoqda…

source: Font Size
ru: Размер шрифта
uz_cyrl: Шрифт ўлчами
uz_uz: Shrift oʻlchami

# font_size_desc
source: All app text scales accordingly
ru: Масштабируется весь текст приложения
uz_cyrl: Бутун илова матни шунга мослашади
uz_uz: Butun ilova matni shunga moslashadi

# greeting_day
source: Good afternoon!
ru: Добрый день!
uz_cyrl: Хайрли кун!
uz_uz: Xayrli kun!

# greeting_evening
source: Good evening!
ru: Добрый вечер!
uz_cyrl: Хайрли кеч!
uz_uz: Xayrli kech!

# greeting_morning
source: Good morning!
ru: Доброе утро!
uz_cyrl: Хайрли тонг!
uz_uz: Xayrli tong!

source: Home
ru: Главная
uz_cyrl: Бош саҳифа
uz_uz: Bosh sahifa

source: Increase
ru: Увеличить
uz_cyrl: Кўпайтириш
uz_uz: Koʻpaytirish

source: Jump to page
ru: Перейти к странице
uz_cyrl: Саҳифага ўтиш
uz_uz: Sahifaga oʻtish

source: Keep Screen Awake
ru: Не выключать экран
uz_cyrl: Экран ўчмасин
uz_uz: Ekran oʻchmasin

source: Language
ru: Язык
uz_cyrl: Тил
uz_uz: Til

# language_desc
source: App interface language
ru: Язык интерфейса приложения
uz_cyrl: Илова интерфейси тили
uz_uz: Ilova interfeysi tili

source: Large
ru: Большой
uz_cyrl: Катта
uz_uz: Katta

source: Last viewed
ru: Последний просмотр
uz_cyrl: Охирги кўрилган
uz_uz: Oxirgi koʻrilgan

source: Lessons
ru: Уроки
uz_cyrl: Дарслар
uz_uz: Darslar

source: Light
ru: Светлая
uz_cyrl: Кундузги
uz_uz: Kunduzgi

source: Line Spacing
ru: Межстрочный интервал
uz_cyrl: Қатор оралиғи
uz_uz: Qator oraligʻi

source: Loading...
ru: Загрузка...
uz_cyrl: Юкланмоқда...
uz_uz: Yuklanmoqda...

source: Loop
ru: Повтор
uz_cyrl: Такрор
uz_uz: Takror

source: Medium
ru: Средний
uz_cyrl: Ўрта
uz_uz: Oʻrta

source: Next
ru: Следующий
uz_cyrl: Кейинги
uz_uz: Keyingi

source: Next element
ru: Следующий элемент
uz_cyrl: Кейинги элемент
uz_uz: Keyingi element

source: Next page
ru: Следующая страница
uz_cyrl: Кейинги саҳифа
uz_uz: Keyingi sahifa

# no_lessons
source: No lessons yet
ru: Пока нет уроков
uz_cyrl: Ҳозирча дарс йўқ
uz_uz: Hozircha dars yoʻq

# ob_bg
source: Download continues in the background
ru: Загрузка продолжится в фоне
uz_cyrl: Юклаб олиш фонда давом этади
uz_uz: Yuklab olish fonda davom etadi

# ob_download
source: Download audio
ru: Скачать аудио
uz_cyrl: Аудио юклаб олиш
uz_uz: Audio yuklab olish

# ob_feat1_desc
source: Every letter, syllable and word with precise pronunciation
ru: Каждая буква, слог и слово с точным произношением
uz_cyrl: Ҳар ҳарф, бўғин ва сўз аниқ талаффуз билан
uz_uz: Har harf, boʻgʻin va soʻz aniq talaffuz bilan

# ob_feat1_title
source: Audio with correct articulation
ru: Аудио с правильным произношением
uz_cyrl: Тўғри махраждан аудио
uz_uz: Toʻgʻri mahrajdan audio

# ob_feat2_desc
source: From the alphabet to surahs and prayers, each page hand-crafted
ru: От алфавита до сур и молитв, каждая страница оформлена вручную
uz_cyrl: Алифбодан суралар ва дуоларгача, ҳар саҳифа алоҳида ишланган
uz_uz: Alifbodan suralar va duolargacha, har sahifa alohida ishlangan

# ob_feat2_title
source: 52 pages — the whole book
ru: 52 страницы — вся книга
uz_cyrl: 52 саҳифа — бутун китоб
uz_uz: 52 sahifa — butun kitob

# ob_feat3_desc
source: Download the audio once — then offline, uninterrupted
ru: Скачайте аудио один раз — дальше офлайн, без прерываний
uz_cyrl: Аудиони бир марта юклаб олинг — кейин офлайн, узилишсиз
uz_uz: Audioni bir marta yuklab oling — keyin oflayn, uzilishsiz

# ob_feat3_title
source: Works without internet
ru: Работает без интернета
uz_cyrl: Интернетсиз ишлайди
uz_uz: Internetsiz ishlaydi

# ob_later
source: Download later
ru: Скачать позже
uz_cyrl: Кейинроқ юклайман
uz_uz: Keyinroq yuklayman

# ob_prompt
source: To use the app fully, download the audio (~127 MB).
ru: Чтобы пользоваться приложением полностью, скачайте аудио (~127 МБ).
uz_cyrl: Иловадан тўлиқ фойдаланиш учун аудиони (~127 MB) юклаб олинг.
uz_uz: Ilovadan toʻliq foydalanish uchun audioni (~127 MB) yuklab oling.

# ob_ready
source: Audio ready — the app works offline
ru: Аудио готово — приложение работает офлайн
uz_cyrl: Аудио тайёр — илова офлайн ишлайди
uz_uz: Audio tayyor — ilova oflayn ishlaydi

# ob_skip
source: Start without downloading
ru: Начать без загрузки
uz_cyrl: Юкламасдан бошлаш
uz_uz: Yuklamasdan boshlash

source: Offline audio
ru: Офлайн-аудио
uz_cyrl: Офлайн аудио

# offline_audio_wait
source: Audio playing — download waiting
ru: Воспроизводится аудио — загрузка ждёт
uz_cyrl: Аудио тингланмоқда — кутиб турибди
uz_uz: Audio tinglanmoqda — kutib turibdi

# offline_card_desc
source: Audio ~127 MB. Downloaded once, then the app works without internet.
ru: Аудио ~127 МБ. Скачивается один раз, затем приложение работает без интернета.
uz_cyrl: Аудио ~127 MB. Бир марта юклаб олинади, кейин илова интернетсиз ишлайди.
uz_uz: Audio ~127 MB. Bir marta yuklab olinadi, keyin ilova internetsiz ishlaydi.

# offline_desc
source: Lessons, audio and images are saved to your device — the app works fully without internet
ru: Уроки, аудио и изображения сохраняются на устройстве — приложение полностью работает без интернета
uz_cyrl: Дарслар, аудио ва расмлар қурилмага сақланади — илова интернетсиз ҳам тўлиқ ишлайди
uz_uz: Darslar, audio va rasmlar qurilmaga saqlanadi — ilova internetsiz ham toʻliq ishlaydi

# offline_done
source: All content saved to your device
ru: Весь контент сохранён на устройстве
uz_cyrl: Барча контент қурилмага сақланди
uz_uz: Barcha kontent qurilmaga saqlandi

# offline_done_partial
source: Some files failed — will retry next time
ru: Некоторые файлы не загрузились — повторим в следующий раз
uz_cyrl: Айрим файллар юкланмади — кейинги сафар қайта уринилади
uz_uz: Ayrim fayllar yuklanmadi — keyingi safar qayta uriniladi

# offline_files
source: files
ru: файлов
uz_cyrl: файл
uz_uz: fayl

# offline_idle
source: Preparing…
ru: Подготовка…
uz_cyrl: Тайёрланмоқда…
uz_uz: Tayyorlanmoqda…

# offline_offline
source: No internet — will resume when connected
ru: Нет интернета — продолжится при подключении
uz_cyrl: Интернет йўқ — уланиши билан давом этади
uz_uz: Internet yoʻq — ulanishi bilan davom etadi

# offline_pause
source: Pause
ru: Пауза
uz_cyrl: Тўхтатиш
uz_uz: Toʻxtatish

# offline_paused
source: Paused
ru: Приостановлено
uz_cyrl: Тўхтатилган
uz_uz: Toʻxtatilgan

# offline_ready
source: Audio downloaded — the app works offline
ru: Аудио загружено — приложение работает офлайн
uz_cyrl: Аудио юклаб олинган — илова офлайн ишлайди
uz_uz: Audio yuklab olingan — ilova oflayn ishlaydi

# offline_resume
source: Resume
ru: Продолжить
uz_cyrl: Давом эттириш
uz_uz: Davom ettirish

# offline_running
source: Downloading in background…
ru: Загрузка в фоне…
uz_cyrl: Фонда юкланмоқда…
uz_uz: Fonda yuklanmoqda…

# offline_scanning
source: Checking…
ru: Проверка…
uz_cyrl: Текширилмоқда…
uz_uz: Tekshirilmoqda…

# offline_title
source: Offline mode
ru: Офлайн-режим
uz_cyrl: Офлайн режим
uz_uz: Oflayn rejim

# offline_unsupported
source: Your browser does not support offline storage
ru: Ваш браузер не поддерживает офлайн-хранение
uz_cyrl: Браузерингиз офлайн сақлашни қўллаб-қувватламайди
uz_uz: Brauzeringiz oflayn saqlashni qoʻllab-quvvatlamaydi

source: Page
ru: Страница
uz_cyrl: Саҳифа
uz_uz: Sahifa

# page_no_elements
source: No elements to show on this page.
ru: На этой странице нет элементов.
uz_cyrl: Бу саҳифада кўрсатиладиган элемент йўқ.
uz_uz: Bu sahifada koʻrsatiladigan element yoʻq.

source: Page %@ of %@
ru: Страница %@ из %@
uz_cyrl: Саҳифа %@ / %@
uz_uz: Sahifa %@ / %@

source: pages
ru: стр.
uz_cyrl: саҳифа
uz_uz: sahifa

source: Pause
ru: Пауза
uz_cyrl: Тўхтатиш
uz_uz: Toʻxtatish

source: Play
ru: Играть
uz_cyrl: Ижро
uz_uz: Ijro

# prev
source: Previous
ru: Предыдущий
uz_cyrl: Олдинги
uz_uz: Oldingi

# prev_element
source: Previous element
ru: Предыдущий элемент
uz_cyrl: Олдинги элемент
uz_uz: Oldingi element

# prev_page
source: Previous page
ru: Предыдущая страница
uz_cyrl: Олдинги саҳифа
uz_uz: Oldingi sahifa

source: Privacy Policy
ru: Политика конфиденциальности
uz_cyrl: Махфийлик сиёсати
uz_uz: Maxfiylik siyosati

# reading_background
source: Background
ru: Фон
uz_cyrl: Фон
uz_uz: Fon

source: Reading Options
ru: Настройки чтения
uz_cyrl: Ўқиш созламалари
uz_uz: Oʻqish sozlamalari

source: Re-download
ru: Скачать заново
uz_cyrl: Қайта юклаш
uz_uz: Qayta yuklash

source: Repeat Count
ru: Количество повторений
uz_cyrl: Такрорлаш сони
uz_uz: Takrorlash soni

# repeat_desc
source: How many times audio repeats when you tap an element
ru: Сколько раз повторяется аудио при нажатии на элемент
uz_cyrl: Элемент босилганда аудио неча марта такрорланади
uz_uz: Element bosilganda audio necha marta takrorlanadi

# repeat_reset_hint
source: Resets to 1× when the app reopens
ru: При перезапуске приложения сбрасывается до 1×
uz_cyrl: Илова қайта очилганда 1× га қайтади
uz_uz: Ilova qayta ochilganda 1× ga qaytadi

source: Replay
ru: Переслушать
uz_cyrl: Қайта тинглаш
uz_uz: Qayta tinglash

source: Retry
ru: Повторить
uz_cyrl: Қайта уриниш
uz_uz: Qayta urinish

source: Sequential
ru: Последовательно
uz_cyrl: Кетма-кет
uz_uz: Ketma-ket

source: Settings
ru: Настройки
uz_cyrl: Созламалар
uz_uz: Sozlamalar

# settings_subtitle
source: Customize the app to your liking
ru: Настройте приложение под себя
uz_cyrl: Иловани ўзингизга мосланг
uz_uz: Ilovani oʻzingizga moslang

source: Small
ru: Маленький
uz_cyrl: Кичик
uz_uz: Kichik

source: Speed
ru: Скорость
uz_cyrl: Тезлик
uz_uz: Tezlik

source: Start
ru: Начать
uz_cyrl: Бошлаш
uz_uz: Boshlash

# start_subtitle
source: Begin learning the book
ru: Начните изучение книги
uz_cyrl: Китобни ўрганишни бошланг
uz_uz: Kitobni oʻrganishni boshlang

# stat_audio_get
source: get audio
ru: скачать аудио
uz_cyrl: аудио юкланг
uz_uz: audio yuklang

# stat_audio_ready
source: audio offline
ru: аудио офлайн
uz_cyrl: аудио офлайн
uz_uz: audio oflayn

# stat_done
source: done
ru: пройдено
uz_cyrl: тугади
uz_uz: tugadi

source: Strong Highlight
ru: Усиленное выделение
uz_cyrl: Кучли ажратиб кўрсатиш
uz_uz: Kuchli ajratib koʻrsatish

source: System
ru: Системная
uz_cyrl: Тизим
uz_uz: Tizim

source: Terms of Use
ru: Условия использования
uz_cyrl: Фойдаланиш шартлари
uz_uz: Foydalanish shartlari

source: Text Size
ru: Размер текста
uz_cyrl: Матн ўлчами
uz_uz: Matn oʻlchami

# theme
source: Appearance
ru: Тема
uz_cyrl: Кўриниш
uz_uz: Koʻrinish

# theme_desc
source: Light or dark appearance
ru: Светлое или тёмное оформление
uz_cyrl: Ёруғ ёки қоронғи кўриниш
uz_uz: Yorugʻ yoki qorongʻi koʻrinish

# update_now
source: Update
ru: Обновить
uz_cyrl: Янгилаш
uz_uz: Yangilash

# update_ready
source: New version available
ru: Доступна новая версия
uz_cyrl: Янги версия тайёр
uz_uz: Yangi versiya tayyor

source: Volume
ru: Громкость
uz_cyrl: Овоз
uz_uz: Ovoz

# welcome_adab
source: This book teaches the letters of the Qurʼan. Please use it in a state of ritual purity (wudu).
ru: Эта книга обучает буквам Корана. Пожалуйста, пользуйтесь в состоянии омовения (таҳарат).
uz_cyrl: Бу китоб Қуръон ҳарфларини ўргатади. Илтимос, таҳоратли ҳолда фойдаланинг.
uz_uz: Bu kitob Qurʼon harflarini oʻrgatadi. Iltimos, tahoratli holda foydalaning.

# welcome_desc
source: This app is for reading the book “Ahmad Hodiy Maqsudiy — Muallimi Soniy” and hearing its pronunciation.
ru: Это приложение предназначено для чтения книги «Ахмад Ходи Максуди — Муаллими Соний» и прослушивания произношения.
uz_cyrl: Бу илова «Аҳмад Ҳодий Мақсудий — Муаллими Соний» китобини ўқиш ва талаффузни эшитиш учун мўлжалланган.
uz_uz: Bu ilova «Ahmad Hodiy Maqsudiy — Muallimi Soniy» kitobini oʻqish va talaffuzni eshitish uchun moʻljallangan.

# welcome_offline
source: The app works offline. Internet is only needed to download new content.
ru: Приложение работает офлайн. Интернет нужен только для загрузки нового контента.
uz_cyrl: Илова офлайн ишлайди. Интернет фақат янги контент юклаш учун керак.
uz_uz: Ilova oflayn ishlaydi. Internet faqat yangi kontent yuklash uchun kerak.

# welcome_title
source: Welcome!
ru: Добро пожаловать!
uz_cyrl: Хуш келибсиз!
uz_uz: Xush kelibsiz!
